/////////////////////////////////////////////////////////////////////////////
//EDA工具平台：Vivado 2019.1 + ModelSim SE-64 10.5 
//开发套件型号： STAR 入门FPGA开发套件
//版   权  申   明： 本例程由《深入浅出玩转FPGA》作者“特权同学”原创，
//				仅供特权同学相关FPGA开发套件学习使用，谢谢支持
//官方淘宝店铺： http://myfpga.taobao.com/
//微 信 公 众 号：“FPGA快乐学习”
//				欢迎关注，获取更多更新的FPGA学习资料 
/////////////////////////////////////////////////////////////////////////////
`timescale 1ns/1ps
module testbench_top();
	
////////////////////////////////////////////////////////////
//参数定义

`define CLK_PERIORD		10		//时钟周期设置为10ns（100MHz）	

////////////////////////////////////////////////////////////
//接口申明
	
reg clk;
reg rst_n;
reg a;
reg b;
wire c;	

////////////////////////////////////////////////////////////	
//对被测试的设计进行例化
	
vlg_design		uut_vlg_design(
	.clk(clk),
	.rst_n(rst_n),
	.a(a),
	.b(b),
	.c(c)
    );	
	
////////////////////////////////////////////////////////////
//复位和时钟产生

	//时钟和复位初始化、复位产生
initial begin
	clk <= 0;
	rst_n <= 0;
	#1000;
	rst_n <= 1;
end
	
	//时钟产生
always #(`CLK_PERIORD/2) clk = ~clk;	

////////////////////////////////////////////////////////////
//测试激励产生

initial begin
	a <= 0;
	b <= 0;
	@(posedge rst_n);	//等待复位完成
	
	@(posedge clk);
	a <= 0;
	b <= 0;	
	
	@(posedge clk);
	a <= 1;
	b <= 0;

	@(posedge clk);
	a <= 0;
	b <= 1;	
	
	@(posedge clk);
	a <= 1;
	b <= 1;
	
	@(posedge clk);
	a <= 0;
	b <= 0;		

	repeat(10) begin
		@(posedge clk);
	end
	
	$stop;
end


endmodule






